cherry-embedded/CherryUSB/port/stm32/usb_dc_nohal.c
#include "usbd_core.h"
#ifdef STM32F1
#include "stm32f1xx_hal.h" //chanage this header for different soc
#elif defined(STM32F4)
#include "stm32f4xx_hal.h" //chanage this header for different soc
#elif defined(STM32H7)
#include "stm32h7xx_hal.h" //chanage this header for different soc
#endif

#ifndef USB_RAM_SIZE
#define USB_RAM_SIZE 512
#endif
#ifndef USB_NUM_BIDIR_ENDPOINTS
#define USB_NUM_BIDIR_ENDPOINTS 8
#endif

/* Endpoint state */
struct usb_dc_ep_state {
    /** Endpoint max packet size */
    uint16_t ep_mps;
    /** Endpoint Transfer Type.
     * May be Bulk, Interrupt, Control or Isochronous
     */
    uint8_t ep_type;
    uint8_t ep_stalled; /** Endpoint stall flag */
#ifdef USB
    uint16_t ep_pma_buf_len; /** Previously allocated buffer size */
    uint16_t ep_pma_addr;    /**ep pmd allocated addr*/
#elif defined(USB_OTG_FS) || defined(USB_OTG_HS)
#endif
};

/* Driver state */
struct usb_dc_config_priv {
    PCD_TypeDef *Instance;                                  /*!< Register base address */
    PCD_InitTypeDef Init;                                   /*!< PCD required parameters */
    __IO uint8_t USB_Address;                               /*!< USB Address */
    struct usb_dc_ep_state in_ep[USB_NUM_BIDIR_ENDPOINTS];  /*!< IN endpoint parameters*/
    struct usb_dc_ep_state out_ep[USB_NUM_BIDIR_ENDPOINTS]; /*!< OUT endpoint parameters */
#ifdef USB
    uint32_t pma_offset;
#endif
} usb_dc_cfg;

int usb_dc_init(void)
{
    memset(&usb_dc_cfg, 0, sizeof(struct usb_dc_config_priv));
#ifdef USB
    usb_dc_cfg.Instance = USB;
    usb_dc_cfg.pma_offset = 64;
    usb_dc_cfg.Init.speed = PCD_SPEED_FULL;
#elif defined(USB_OTG_FS) || defined(USB_OTG_HS)
#ifdef CONFIG_USB_HS
    usb_dc_cfg.Instance = USB_OTG_HS;
    usb_dc_cfg.Init.speed = PCD_SPEED_FULL;
    usb_dc_cfg.Init.dma_enable = DISABLE;
    usb_dc_cfg.Init.phy_itface = USB_OTG_ULPI_PHY;
    usb_dc_cfg.Init.vbus_sensing_enable = DISABLE;
    usb_dc_cfg.Init.use_dedicated_ep1 = DISABLE;
    usb_dc_cfg.Init.use_external_vbus = DISABLE;
#else
    //usb_dc_cfg.Instance = USB_OTG_HS;  //run in full speed
    usb_dc_cfg.Instance = USB_OTG_FS;
    usb_dc_cfg.Init.speed = PCD_SPEED_FULL;
    usb_dc_cfg.Init.dma_enable = DISABLE;
    usb_dc_cfg.Init.phy_itface = USB_OTG_EMBEDDED_PHY;
    usb_dc_cfg.Init.vbus_sensing_enable = DISABLE;
    usb_dc_cfg.Init.use_dedicated_ep1 = DISABLE;
    usb_dc_cfg.Init.use_external_vbus = DISABLE;
#endif
#endif
    PCD_TypeDef *USBx = usb_dc_cfg.Instance;

    usb_dc_cfg.Init.dev_endpoints = USB_NUM_BIDIR_ENDPOINTS;
    usb_dc_cfg.Init.Sof_enable = DISABLE;
    usb_dc_cfg.Init.low_power_enable = DISABLE;
    usb_dc_cfg.Init.lpm_enable = DISABLE;

    HAL_PCD_MspInit((PCD_HandleTypeDef *)&usb_dc_cfg);

#ifdef USB
    USB_DisableGlobalInt(USBx);
    USB_DevInit(USBx, usb_dc_cfg.Init);
    USB_EnableGlobalInt(USBx);
#elif defined(USB_OTG_FS) || defined(USB_OTG_HS)
    /* Disable DMA mode for FS instance */
#ifndef CONFIG_USB_HS
    if ((USBx->CID & (0x1U << 8)) == 0U) {
        usb_dc_cfg.Init.dma_enable = 0U;
    }
#endif
    /* Disable the Interrupts */
    USB_DisableGlobalInt(USBx);

    /*Init the Core (common init.) */
    if (USB_CoreInit(usb_dc_cfg.Instance, usb_dc_cfg.Init) != HAL_OK) {
        return -1;
    }

    /* Force Device Mode*/
    (void)USB_SetCurrentMode(USBx, USB_DEVICE_MODE);

    /* Init Device */
    if (USB_DevInit(USBx, usb_dc_cfg.Init) != HAL_OK) {
        return -1;
    }

    USB_DevDisconnect(USBx);

    if ((usb_dc_cfg.Init.battery_charging_enable == 1U) &&
        (usb_dc_cfg.Init.phy_itface != USB_OTG_ULPI_PHY)) {
        /* Enable USB Transceiver */
        USBx->GCCFG |= USB_OTG_GCCFG_PWRDWN;
    }
    (void)USB_DevConnect(USBx);
    /* Enable the Interrupts */
    USB_EnableGlobalInt(USBx);
#endif
    return 0;
}

void usb_dc_deinit(void)
{
    PCD_TypeDef *USBx = usb_dc_cfg.Instance;
    USB_StopDevice(USBx);
    HAL_PCD_MspDeInit((PCD_HandleTypeDef *)&usb_dc_cfg);
}

int usbd_set_address(const uint8_t addr)
{
    PCD_TypeDef *USBx = usb_dc_cfg.Instance;

    USB_SetDevAddress(USBx, addr);
    usb_dc_cfg.USB_Address = addr;
    return 0;
}

int usbd_ep_open(const struct usbd_endpoint_cfg *ep_cfg)
{
    PCD_TypeDef *USBx = usb_dc_cfg.Instance;
    uint8_t ep_idx = USB_EP_GET_IDX(ep_cfg->ep_addr);
#if defined(USB_OTG_FS) || defined(USB_OTG_HS)
    uint32_t USBx_BASE = (uint32_t)USBx;
#endif
    if (!ep_cfg) {
        return -1;
    }

#ifdef USB
    uint16_t wEpRegVal;

    wEpRegVal = PCD_GET_ENDPOINT(USBx, ep_idx) & USB_EP_T_MASK;
    /* initialize Endpoint */
    switch (ep_cfg->ep_type) {
        case EP_TYPE_CTRL:
            wEpRegVal |= USB_EP_CONTROL;
            break;

        case EP_TYPE_BULK:
            wEpRegVal |= USB_EP_BULK;
            break;

        case EP_TYPE_INTR:
            wEpRegVal |= USB_EP_INTERRUPT;
            break;

        case EP_TYPE_ISOC:
            wEpRegVal |= USB_EP_ISOCHRONOUS;
            break;

        default:
            break;
    }
    PCD_SET_ENDPOINT(USBx, ep_idx, (wEpRegVal | USB_EP_CTR_RX | USB_EP_CTR_TX));

    PCD_SET_EP_ADDRESS(USBx, ep_idx, ep_idx);
    if (USB_EP_DIR_IS_OUT(ep_cfg->ep_addr)) {
        usb_dc_cfg.out_ep[ep_idx].ep_mps = ep_cfg->ep_mps;
        usb_dc_cfg.out_ep[ep_idx].ep_type = ep_cfg->ep_type;
        if (usb_dc_cfg.out_ep[ep_idx].ep_mps > usb_dc_cfg.out_ep[ep_idx].ep_pma_buf_len) {
            if (usb_dc_cfg.pma_offset + usb_dc_cfg.out_ep[ep_idx].ep_mps >= 512) {
                return -1;
            }
            usb_dc_cfg.out_ep[ep_idx].ep_pma_buf_len = ep_cfg->ep_mps;
            usb_dc_cfg.out_ep[ep_idx].ep_pma_addr = usb_dc_cfg.pma_offset;
            /*Set the endpoint Receive buffer address */
            PCD_SET_EP_RX_ADDRESS(USBx, ep_idx, usb_dc_cfg.pma_offset);
            usb_dc_cfg.pma_offset += ep_cfg->ep_mps;
        }
        /*Set the endpoint Receive buffer counter*/
        PCD_SET_EP_RX_CNT(USBx, ep_idx, ep_cfg->ep_mps);
        PCD_CLEAR_RX_DTOG(USBx, ep_idx);

        /* Configure VALID status for the Endpoint*/
        PCD_SET_EP_RX_STATUS(USBx, ep_idx, USB_EP_RX_VALID);
    } else {
        usb_dc_cfg.in_ep[ep_idx].ep_mps = ep_cfg->ep_mps;
        usb_dc_cfg.in_ep[ep_idx].ep_type = ep_cfg->ep_type;
        if (usb_dc_cfg.in_ep[ep_idx].ep_mps > usb_dc_cfg.in_ep[ep_idx].ep_pma_buf_len) {
            if (usb_dc_cfg.pma_offset + usb_dc_cfg.in_ep[ep_idx].ep_mps >= USB_RAM_SIZE) {
                return -1;
            }
            usb_dc_cfg.in_ep[ep_idx].ep_pma_buf_len = ep_cfg->ep_mps;
            usb_dc_cfg.in_ep[ep_idx].ep_pma_addr = usb_dc_cfg.pma_offset;
            /*Set the endpoint Transmit buffer address */
            PCD_SET_EP_TX_ADDRESS(USBx, ep_idx, usb_dc_cfg.pma_offset);
            usb_dc_cfg.pma_offset += ep_cfg->ep_mps;
        }

