cherry-embedded/CherryUSB/port/stm32/usb_dc_nohal.c
        PCD_CLEAR_TX_DTOG(USBx, ep_idx);
        if (ep_cfg->ep_type != EP_TYPE_ISOC) {
            /* Configure NAK status for the Endpoint */
            PCD_SET_EP_TX_STATUS(USBx, ep_idx, USB_EP_TX_NAK);
        } else {
            /* Configure TX Endpoint to disabled state */
            PCD_SET_EP_TX_STATUS(USBx, ep_idx, USB_EP_TX_DIS);
        }
    }
#elif defined(USB_OTG_FS) || defined(USB_OTG_HS)
    if (USB_EP_DIR_IS_OUT(ep_cfg->ep_addr)) {
        usb_dc_cfg.out_ep[ep_idx].ep_mps = ep_cfg->ep_mps;
        usb_dc_cfg.out_ep[ep_idx].ep_type = ep_cfg->ep_type;
        USBx_DEVICE->DAINTMSK |= USB_OTG_DAINTMSK_OEPM & ((uint32_t)(1UL << (ep_idx & EP_ADDR_MSK)) << 16);

        if (((USBx_OUTEP(ep_idx)->DOEPCTL) & USB_OTG_DOEPCTL_USBAEP) == 0U) {
            USBx_OUTEP(ep_idx)->DOEPCTL |= (ep_cfg->ep_mps & USB_OTG_DOEPCTL_MPSIZ) |
                                           ((uint32_t)ep_cfg->ep_type << 18) |
                                           USB_OTG_DIEPCTL_SD0PID_SEVNFRM |
                                           USB_OTG_DOEPCTL_USBAEP;
        }

    } else {
        usb_dc_cfg.in_ep[ep_idx].ep_mps = ep_cfg->ep_mps;
        usb_dc_cfg.in_ep[ep_idx].ep_type = ep_cfg->ep_type;
        USBx_DEVICE->DAINTMSK |= USB_OTG_DAINTMSK_IEPM & (uint32_t)(1UL << (ep_idx & EP_ADDR_MSK));

        if ((USBx_INEP(ep_idx)->DIEPCTL & USB_OTG_DIEPCTL_USBAEP) == 0U) {
            USBx_INEP(ep_idx)->DIEPCTL |= (ep_cfg->ep_mps & USB_OTG_DIEPCTL_MPSIZ) |
                                          ((uint32_t)ep_cfg->ep_type << 18) | (ep_idx << 22) |
                                          USB_OTG_DIEPCTL_SD0PID_SEVNFRM |
                                          USB_OTG_DIEPCTL_USBAEP;
        }
    }

#endif

    return 0;
}
int usbd_ep_close(const uint8_t ep)
{
    PCD_TypeDef *USBx = usb_dc_cfg.Instance;
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
#if defined(USB_OTG_FS) || defined(USB_OTG_HS)
    uint32_t USBx_BASE = (uint32_t)USBx;
#endif
    if (USB_EP_DIR_IS_OUT(ep)) {
#ifdef USB
        PCD_CLEAR_RX_DTOG(USBx, ep_idx);

        /* Configure DISABLE status for the Endpoint*/
        PCD_SET_EP_RX_STATUS(USBx, ep_idx, USB_EP_RX_DIS);
#elif defined(USB_OTG_FS) || defined(USB_OTG_HS)
        if (((USBx_OUTEP(ep_idx)->DOEPCTL) & USB_OTG_DOEPCTL_USBAEP) == 0U) {
            USBx_OUTEP(ep_idx)->DOEPCTL |= (usb_dc_cfg.out_ep[ep_idx].ep_mps & USB_OTG_DOEPCTL_MPSIZ) |
                                           ((uint32_t)usb_dc_cfg.out_ep[ep_idx].ep_type << 18) | (ep_idx << 22) |
                                           USB_OTG_DOEPCTL_USBAEP;
        }

        USBx_DEVICE->DEACHMSK |= USB_OTG_DAINTMSK_OEPM & ((uint32_t)(1UL << (ep_idx & EP_ADDR_MSK)) << 16);
#endif
    } else {
#ifdef USB
        PCD_CLEAR_TX_DTOG(USBx, ep_idx);

        /* Configure DISABLE status for the Endpoint*/
        PCD_SET_EP_TX_STATUS(USBx, ep_idx, USB_EP_TX_DIS);
#elif defined(USB_OTG_FS) || defined(USB_OTG_HS)
        if (((USBx_INEP(ep_idx)->DIEPCTL) & USB_OTG_DIEPCTL_USBAEP) == 0U) {
            USBx_INEP(ep_idx)->DIEPCTL |= (usb_dc_cfg.in_ep[ep_idx].ep_mps & USB_OTG_DIEPCTL_MPSIZ) |
                                          ((uint32_t)usb_dc_cfg.in_ep[ep_idx].ep_type << 18) | (ep_idx << 22) |
                                          USB_OTG_DIEPCTL_SD0PID_SEVNFRM |
                                          USB_OTG_DIEPCTL_USBAEP;
        }

        USBx_DEVICE->DEACHMSK |= USB_OTG_DAINTMSK_IEPM & (uint32_t)(1UL << (ep_idx & EP_ADDR_MSK));
#endif
    }
    return 0;
}
int usbd_ep_set_stall(const uint8_t ep)
{
    PCD_TypeDef *USBx = usb_dc_cfg.Instance;
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
#if defined(USB_OTG_FS) || defined(USB_OTG_HS)
    uint32_t USBx_BASE = (uint32_t)USBx;
#endif
    if (USB_EP_DIR_IS_OUT(ep)) {
#ifdef USB
        PCD_SET_EP_RX_STATUS(USBx, ep_idx, USB_EP_RX_STALL);
#elif defined(USB_OTG_FS) || defined(USB_OTG_HS)
        if (((USBx_OUTEP(ep_idx)->DOEPCTL & USB_OTG_DOEPCTL_EPENA) == 0U) && (ep_idx != 0U)) {
            USBx_OUTEP(ep_idx)->DOEPCTL &= ~(USB_OTG_DOEPCTL_EPDIS);
        }
        USBx_OUTEP(ep_idx)->DOEPCTL |= USB_OTG_DOEPCTL_STALL;
#endif
    } else {
#ifdef USB
        PCD_SET_EP_TX_STATUS(USBx, ep_idx, USB_EP_TX_STALL);
#elif defined(USB_OTG_FS) || defined(USB_OTG_HS)
        if (((USBx_INEP(ep_idx)->DIEPCTL & USB_OTG_DIEPCTL_EPENA) == 0U) && (ep_idx != 0U)) {
            USBx_INEP(ep_idx)->DIEPCTL &= ~(USB_OTG_DIEPCTL_EPDIS);
        }
        USBx_INEP(ep_idx)->DIEPCTL |= USB_OTG_DIEPCTL_STALL;
#endif
    }
    return 0;
}
int usbd_ep_clear_stall(const uint8_t ep)
{
    PCD_TypeDef *USBx = usb_dc_cfg.Instance;
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
#if defined(USB_OTG_FS) || defined(USB_OTG_HS)
    uint32_t USBx_BASE = (uint32_t)USBx;
#endif
    if (USB_EP_DIR_IS_OUT(ep)) {
#ifdef USB
        PCD_CLEAR_TX_DTOG(USBx, ep_idx);

        if (usb_dc_cfg.in_ep[ep_idx].ep_type != EP_TYPE_ISOC) {
            /* Configure NAK status for the Endpoint */
            PCD_SET_EP_TX_STATUS(USBx, ep_idx, USB_EP_TX_NAK);
        }
#elif defined(USB_OTG_FS) || defined(USB_OTG_HS)
        USBx_OUTEP(ep_idx)->DOEPCTL &= ~USB_OTG_DOEPCTL_STALL;
        if ((usb_dc_cfg.out_ep[ep_idx].ep_type == EP_TYPE_INTR) || (usb_dc_cfg.out_ep[ep_idx].ep_type == EP_TYPE_BULK)) {
            USBx_OUTEP(ep_idx)->DOEPCTL |= USB_OTG_DOEPCTL_SD0PID_SEVNFRM; /* DATA0 */
        }
#endif
    } else {
#ifdef USB
        PCD_CLEAR_RX_DTOG(USBx, ep_idx);
        /* Configure VALID status for the Endpoint */
        PCD_SET_EP_RX_STATUS(USBx, ep_idx, USB_EP_RX_VALID);
#elif defined(USB_OTG_FS) || defined(USB_OTG_HS)
        USBx_INEP(ep_idx)->DIEPCTL &= ~USB_OTG_DIEPCTL_STALL;
        if ((usb_dc_cfg.in_ep[ep_idx].ep_type == EP_TYPE_INTR) || (usb_dc_cfg.in_ep[ep_idx].ep_type == EP_TYPE_BULK)) {
            USBx_INEP(ep_idx)->DIEPCTL |= USB_OTG_DIEPCTL_SD0PID_SEVNFRM; /* DATA0 */
        }
#endif
    }
    return 0;
}
int usbd_ep_is_stalled(const uint8_t ep, uint8_t *stalled)
{
    PCD_TypeDef *USBx = usb_dc_cfg.Instance;
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
#if defined(USB_OTG_FS) || defined(USB_OTG_HS)
    uint32_t USBx_BASE = (uint32_t)USBx;
#endif
    if (USB_EP_DIR_IS_OUT(ep)) {
    } else {
    }
    return 0;
}

int usbd_ep_write(const uint8_t ep, const uint8_t *data, uint32_t data_len, uint32_t *ret_bytes)
{
    PCD_TypeDef *USBx = usb_dc_cfg.Instance;
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
#if defined(USB_OTG_FS) || defined(USB_OTG_HS)
    uint32_t USBx_BASE = (uint32_t)USBx;
#endif

    if (!data && data_len) {
        return -1;
    }

    if (!data_len) {
#ifdef USB
        PCD_SET_EP_TX_CNT(USBx, ep_idx, (uint16_t)0);
        PCD_SET_EP_TX_STATUS(USBx, ep_idx, USB_EP_TX_VALID);
#elif defined(USB_OTG_FS) || defined(USB_OTG_HS)
        USBx_INEP(ep_idx)->DIEPTSIZ &= ~(USB_OTG_DIEPTSIZ_PKTCNT);
        USBx_INEP(ep_idx)->DIEPTSIZ |= (USB_OTG_DIEPTSIZ_PKTCNT & (1U << 19));
        USBx_INEP(ep_idx)->DIEPTSIZ &= ~(USB_OTG_DIEPTSIZ_XFRSIZ);

        /* EP enable, IN data in FIFO */
        USBx_INEP(ep_idx)->DIEPCTL |= (USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA);

#endif
        return 0;
    }

    if (data_len > usb_dc_cfg.in_ep[ep_idx].ep_mps) {
        data_len = usb_dc_cfg.in_ep[ep_idx].ep_mps;
    }
#ifdef USB
    USB_WritePMA(USBx, (uint8_t *)data, usb_dc_cfg.in_ep[ep_idx].ep_pma_addr, (uint16_t)data_len);
    PCD_SET_EP_TX_CNT(USBx, ep_idx, (uint16_t)data_len);
    PCD_SET_EP_TX_STATUS(USBx, ep_idx, USB_EP_TX_VALID);
#elif defined(USB_OTG_FS) || defined(USB_OTG_HS)

    if (ep_idx == 0x00) {
        /* Program the transfer size and packet count
      * as follows: xfersize = N * maxpacket +
      * short_packet pktcnt = N + (short_packet
      * exist ? 1 : 0)
      */
        USBx_INEP(ep_idx)->DIEPTSIZ &= ~(USB_OTG_DIEPTSIZ_XFRSIZ);
        USBx_INEP(ep_idx)->DIEPTSIZ &= ~(USB_OTG_DIEPTSIZ_PKTCNT);
        USBx_INEP(ep_idx)->DIEPTSIZ |= (USB_OTG_DIEPTSIZ_PKTCNT & (1U << 19));
        USBx_INEP(ep_idx)->DIEPTSIZ |= (USB_OTG_DIEPTSIZ_XFRSIZ & data_len);

        /* EP enable, IN data in FIFO */
        USBx_INEP(ep_idx)->DIEPCTL |= (USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA);

        /* Enable the Tx FIFO Empty Interrupt for this EP */
        USBx_DEVICE->DIEPEMPMSK |= 1UL << (ep_idx & EP_ADDR_MSK);

    } else {
        /* Program the transfer size and packet count
      * as follows: xfersize = N * maxpacket +
      * short_packet pktcnt = N + (short_packet
      * exist ? 1 : 0)
      */
        uint32_t len32b = (data_len + 3) / 4;
        while ((USBx_INEP(ep_idx)->DTXFSTS & USB_OTG_DTXFSTS_INEPTFSAV) >= len32b) {
        }

        USBx_INEP(ep_idx)->DIEPTSIZ &= ~(USB_OTG_DIEPTSIZ_XFRSIZ);
        USBx_INEP(ep_idx)->DIEPTSIZ &= ~(USB_OTG_DIEPTSIZ_PKTCNT);
        USBx_INEP(ep_idx)->DIEPTSIZ |= (USB_OTG_DIEPTSIZ_PKTCNT & (((data_len + usb_dc_cfg.in_ep[ep_idx].ep_mps - 1U) / usb_dc_cfg.in_ep[ep_idx].ep_mps) << 19));
        USBx_INEP(ep_idx)->DIEPTSIZ |= (USB_OTG_DIEPTSIZ_XFRSIZ & data_len);

        if (usb_dc_cfg.in_ep[ep_idx].ep_type == EP_TYPE_ISOC) {
            USBx_INEP(ep_idx)->DIEPTSIZ &= ~(USB_OTG_DIEPTSIZ_MULCNT);
            USBx_INEP(ep_idx)->DIEPTSIZ |= (USB_OTG_DIEPTSIZ_MULCNT & (1U << 29));
        }

