cherry-embedded/CherryUSB/port/stm32/usb_dc_nohal.c
        (void)USB_WritePacket(USBx, (uint8_t *)data, ep_idx, (uint16_t)data_len, 0);

        /* EP enable, IN data in FIFO */
        USBx_INEP(ep_idx)->DIEPCTL |= (USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA);

        if (usb_dc_cfg.in_ep[ep_idx].ep_type != EP_TYPE_ISOC) {
            /* Enable the Tx FIFO Empty Interrupt for this EP */
            //USBx_DEVICE->DIEPEMPMSK |= 1UL << (ep_idx & EP_ADDR_MSK);
        } else {
            if ((USBx_DEVICE->DSTS & (1U << 8)) == 0U) {
                USBx_INEP(ep_idx)->DIEPCTL |= USB_OTG_DIEPCTL_SODDFRM;
            } else {
                USBx_INEP(ep_idx)->DIEPCTL |= USB_OTG_DIEPCTL_SD0PID_SEVNFRM;
            }
        }
    }

#endif
    if (ret_bytes) {
        *ret_bytes = data_len;
    }

    return 0;
}

int usbd_ep_read(const uint8_t ep, uint8_t *data, uint32_t max_data_len, uint32_t *read_bytes)
{
    PCD_TypeDef *USBx = usb_dc_cfg.Instance;
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
#if defined(USB_OTG_FS) || defined(USB_OTG_HS)
    uint32_t USBx_BASE = (uint32_t)USBx;
#endif

    uint32_t read_count;
    if (!data && max_data_len) {
        return -1;
    }

    if (!max_data_len) {
#ifdef USB
        //PCD_SET_EP_RX_CNT(USBx, ep_idx, usb_dc_cfg.out_ep[ep_idx].ep_mps);
        PCD_SET_EP_RX_STATUS(USBx, ep_idx, USB_EP_RX_VALID);
#elif defined(USB_OTG_FS) || defined(USB_OTG_HS)
        /* Program the transfer size and packet count as follows:
    * pktcnt = N
    * xfersize = N * maxpacket
    */
        USBx_OUTEP(ep_idx)->DOEPTSIZ &= ~(USB_OTG_DOEPTSIZ_XFRSIZ);
        USBx_OUTEP(ep_idx)->DOEPTSIZ &= ~(USB_OTG_DOEPTSIZ_PKTCNT);
        USBx_OUTEP(ep_idx)->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_PKTCNT & (1U << 19));
        USBx_OUTEP(ep_idx)->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_XFRSIZ & (usb_dc_cfg.out_ep[ep_idx].ep_mps));

        if (usb_dc_cfg.out_ep[ep_idx].ep_type == EP_TYPE_ISOC) {
            if ((USBx_DEVICE->DSTS & (1U << 8)) == 0U) {
                USBx_OUTEP(ep_idx)->DOEPCTL |= USB_OTG_DOEPCTL_SODDFRM;
            } else {
                USBx_OUTEP(ep_idx)->DOEPCTL |= USB_OTG_DOEPCTL_SD0PID_SEVNFRM;
            }
        }
        /* EP enable */
        USBx_OUTEP(ep_idx)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);

#endif
        return 0;
    }
#ifdef USB
    read_count = PCD_GET_EP_RX_CNT(USBx, ep_idx);
    read_count = MIN(read_count, max_data_len);
    USB_ReadPMA(USBx, (uint8_t *)data,
                usb_dc_cfg.out_ep[ep_idx].ep_pma_addr, (uint16_t)read_count);
    PCD_SET_EP_RX_STATUS(USBx, ep_idx, USB_EP_RX_VALID);
#elif defined(USB_OTG_FS) || defined(USB_OTG_HS)

    read_count = (USBx->GRXSTSP & USB_OTG_GRXSTSP_BCNT) >> 4;
    read_count = MIN(read_count, max_data_len);
    (void)USB_ReadPacket(USBx, data, read_count);

    USBx_OUTEP(ep_idx)->DOEPTSIZ &= ~(USB_OTG_DOEPTSIZ_XFRSIZ);
    USBx_OUTEP(ep_idx)->DOEPTSIZ &= ~(USB_OTG_DOEPTSIZ_PKTCNT);
    USBx_OUTEP(ep_idx)->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_PKTCNT & (1U << 19));
    USBx_OUTEP(ep_idx)->DOEPTSIZ |= (USB_OTG_DOEPTSIZ_XFRSIZ & (usb_dc_cfg.out_ep[ep_idx].ep_mps));

    if (usb_dc_cfg.out_ep[ep_idx].ep_type == EP_TYPE_ISOC) {
        if ((USBx_DEVICE->DSTS & (1U << 8)) == 0U) {
            USBx_OUTEP(ep_idx)->DOEPCTL |= USB_OTG_DOEPCTL_SODDFRM;
        } else {
            USBx_OUTEP(ep_idx)->DOEPCTL |= USB_OTG_DOEPCTL_SD0PID_SEVNFRM;
        }
    }
    /* EP enable */
    USBx_OUTEP(ep_idx)->DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA);

#endif
    if (read_bytes) {
        *read_bytes = read_count;
    }

    return 0;
}

/**
  * @brief  This function handles PCD interrupt request.
  * @param  hpcd PCD handle
  * @retval HAL status
  */
void USBD_IRQHandler(void)
{
#ifdef USB
    uint16_t wIstr, wEPVal;
    uint8_t epindex;
    wIstr = USB->ISTR;

    uint16_t store_ep[8];
    if (wIstr & USB_ISTR_CTR) {
        while ((USB->ISTR & USB_ISTR_CTR) != 0U) {
            wIstr = USB->ISTR;

            /* extract highest priority endpoint number */
            epindex = (uint8_t)(wIstr & USB_ISTR_EP_ID);

            if (epindex == 0U) {
                /* Decode and service control endpoint interrupt */

                /* DIR bit = origin of the interrupt */
                if ((wIstr & USB_ISTR_DIR) == 0U) {
                    /* DIR = 0 */

                    /* DIR = 0 => IN  int */
                    /* DIR = 0 implies that (EP_CTR_TX = 1) always */
                    PCD_CLEAR_TX_EP_CTR(USB, PCD_ENDP0);
                    usbd_event_notify_handler(USB_EVENT_EP0_IN_NOTIFY, NULL);
                    if ((usb_dc_cfg.USB_Address > 0U) && (PCD_GET_EP_TX_CNT(USB, PCD_ENDP0) == 0U)) {
                        USB->DADDR = ((uint16_t)usb_dc_cfg.USB_Address | USB_DADDR_EF);
                        usb_dc_cfg.USB_Address = 0U;
                    }
                }
                /* DIR = 1 */

                /* DIR = 1 & CTR_RX => SETUP or OUT int */
                /* DIR = 1 & (CTR_TX | CTR_RX) => 2 int pending */

                wEPVal = PCD_GET_ENDPOINT(USB, PCD_ENDP0);

                if ((wEPVal & USB_EP_SETUP) != 0U) {
                    /* SETUP bit kept frozen while CTR_RX = 1 */
                    PCD_CLEAR_RX_EP_CTR(USB, PCD_ENDP0);

                    /* Process SETUP Packet*/
                    usbd_event_notify_handler(USB_EVENT_SETUP_NOTIFY, NULL);
                } else if ((wEPVal & USB_EP_CTR_RX) != 0U) {
                    PCD_CLEAR_RX_EP_CTR(USB, PCD_ENDP0);
                    /* Process Control Data OUT Packet */
                    usbd_event_notify_handler(USB_EVENT_EP0_OUT_NOTIFY, NULL);
                }
            } else {
                /* Decode and service non control endpoints interrupt */
                /* process related endpoint register */
                wEPVal = PCD_GET_ENDPOINT(USB, epindex);

                if ((wEPVal & USB_EP_CTR_RX) != 0U) {
                    /* clear int flag */
                    PCD_CLEAR_RX_EP_CTR(USB, epindex);
                    usbd_event_notify_handler(USB_EVENT_EP_OUT_NOTIFY, (void *)(epindex & 0x7f));
                }

                if ((wEPVal & USB_EP_CTR_TX) != 0U) {
                    /* clear int flag */
                    PCD_CLEAR_TX_EP_CTR(USB, epindex);
                    usbd_event_notify_handler(USB_EVENT_EP_IN_NOTIFY, (void *)(epindex | 0x80));
                }
            }
        }
    }
    if (wIstr & USB_ISTR_RESET) {
        struct usbd_endpoint_cfg ep0_cfg;
        /* Configure control EP */
        ep0_cfg.ep_mps = 64;
        ep0_cfg.ep_type = USB_DC_EP_CONTROL;

        ep0_cfg.ep_addr = USB_CONTROL_OUT_EP0;
        usbd_ep_open(&ep0_cfg);

        ep0_cfg.ep_addr = USB_CONTROL_IN_EP0;
        usbd_ep_open(&ep0_cfg);
        usbd_event_notify_handler(USB_EVENT_RESET, NULL);

