cherry-embedded/CherryUSB/port/stm32/usb_dc_nohal.c
        USB->ISTR &= (uint16_t)(~USB_ISTR_RESET);
    }
    if (wIstr & USB_ISTR_PMAOVR) {
        USB->ISTR &= (uint16_t)(~USB_ISTR_PMAOVR);
    }
    if (wIstr & USB_ISTR_ERR) {
        USB->ISTR &= (uint16_t)(~USB_ISTR_ERR);
    }
    if (wIstr & USB_ISTR_WKUP) {
        USB->CNTR &= (uint16_t) ~(USB_CNTR_LP_MODE);
        USB->CNTR &= (uint16_t) ~(USB_CNTR_FSUSP);

        USB->ISTR &= (uint16_t)(~USB_ISTR_WKUP);
    }
    if (wIstr & USB_ISTR_SUSP) {
        /* WA: To Clear Wakeup flag if raised with suspend signal */

        /* Store Endpoint register */
        for (uint8_t i = 0U; i < 8U; i++) {
            store_ep[i] = PCD_GET_ENDPOINT(USB, i);
        }

        /* FORCE RESET */
        USB->CNTR |= (uint16_t)(USB_CNTR_FRES);

        /* CLEAR RESET */
        USB->CNTR &= (uint16_t)(~USB_CNTR_FRES);

        /* wait for reset flag in ISTR */
        while ((USB->ISTR & USB_ISTR_RESET) == 0U) {
        }

        /* Clear Reset Flag */
        USB->ISTR &= (uint16_t)(~USB_ISTR_RESET);
        /* Restore Registre */
        for (uint8_t i = 0U; i < 8U; i++) {
            PCD_SET_ENDPOINT(USB, i, store_ep[i]);
        }

        /* Force low-power mode in the macrocell */
        USB->CNTR |= (uint16_t)USB_CNTR_FSUSP;

        /* clear of the ISTR bit must be done after setting of CNTR_FSUSP */
        USB->ISTR &= (uint16_t)(~USB_ISTR_SUSP);

        USB->CNTR |= (uint16_t)USB_CNTR_LP_MODE;
    }
    if (wIstr & USB_ISTR_SOF) {
        USB->ISTR &= (uint16_t)(~USB_ISTR_SOF);
    }
    if (wIstr & USB_ISTR_ESOF) {
        USB->ISTR &= (uint16_t)(~USB_ISTR_ESOF);
    }
#elif defined(USB_OTG_FS) || defined(USB_OTG_HS)
    PCD_TypeDef *USBx = usb_dc_cfg.Instance;
    uint32_t USBx_BASE = (uint32_t)USBx;
    uint32_t int_status;
    uint32_t temp, epindex, ep_intr, ep_int_status;
    /* ensure that we are in device mode */
    if (USB_GetMode(USBx) == USB_OTG_MODE_DEVICE) {
        while (int_status == USB_ReadInterrupts(USBx)) {
            if (int_status & USB_OTG_GINTSTS_USBRST) {
                usbd_event_notify_handler(USB_EVENT_RESET, NULL);
                USBx->GINTSTS &= USB_OTG_GINTSTS_USBRST;
            }
            if (int_status & USB_OTG_GINTSTS_ENUMDNE) {
                USBx->GINTSTS &= USB_OTG_GINTSTS_ENUMDNE;
            }
            if (int_status & USB_OTG_GINTSTS_RXFLVL) {
                USB_MASK_INTERRUPT(USBx, USB_OTG_GINTSTS_RXFLVL);
                temp = USBx->GRXSTSP;
                epindex = temp & USB_OTG_GRXSTSP_EPNUM;
                if (((temp & USB_OTG_GRXSTSP_PKTSTS) >> 17) == STS_DATA_UPDT) {
                    if (epindex == 0)
                        usbd_event_notify_handler(USB_EVENT_EP0_OUT_NOTIFY, NULL);
                    else {
                        usbd_event_notify_handler(USB_EVENT_EP_OUT_NOTIFY, (void *)(epindex & 0x7f));
                    }
                } else if (((temp & USB_OTG_GRXSTSP_PKTSTS) >> 17) == STS_SETUP_UPDT) {
                    usbd_event_notify_handler(USB_EVENT_SETUP_NOTIFY, NULL);
                } else {
                    /* ... */
                }
                USB_UNMASK_INTERRUPT(USBx, USB_OTG_GINTSTS_RXFLVL);
            }
            if (int_status & USB_OTG_GINTSTS_IEPINT) {
                epindex = 0U;
                /* Read in the device interrupt bits */
                ep_intr = USB_ReadDevAllInEpInterrupt(USBx);

                while (ep_intr != 0U) {
                    if ((ep_intr & 0x1U) != 0U) {
                        /* Read IN EP interrupt status */
                        ep_int_status = USB_ReadDevInEPInterrupt(USBx, (uint8_t)epindex);
                        /* Clear IN EP interrupts */
                        CLEAR_IN_EP_INTR(epindex, ep_int_status);
                        if (ep_int_status & USB_OTG_DIEPINT_XFRC) {
                            usbd_event_notify_handler(USB_EVENT_EP_IN_NOTIFY, (void *)(epindex | 0x80));
                        }
                    }
                    epindex++;
                    ep_intr >>= 1U;
                }
            }
            if (int_status & USB_OTG_GINTSTS_OEPINT) {
                epindex = 0;
                /* Read in the device interrupt bits */
                ep_intr = USB_ReadDevAllOutEpInterrupt(USBx);

                while (ep_intr != 0U) {
                    if ((ep_intr & 0x1U) != 0U) {
                        /* Read OUT EP interrupt status */
                        ep_int_status = USB_ReadDevOutEPInterrupt(USBx, (uint8_t)epindex);
                        /* Clear OUT EP interrupts */
                        CLEAR_OUT_EP_INTR(epindex, ep_int_status);
                    }
                    epindex++;
                    ep_intr >>= 1U;
                }
            }
            if (int_status & USB_OTG_GINTSTS_MMIS) {
                USBx->GINTSTS &= USB_OTG_GINTSTS_MMIS;
            }
            if (int_status & USB_OTG_GINTSTS_WKUINT) {
                USBx->GINTSTS &= USB_OTG_GINTSTS_WKUINT;
            }
            if (int_status & USB_OTG_GINTSTS_USBSUSP) {
                USBx->GINTSTS &= USB_OTG_GINTSTS_USBSUSP;
            }
            //            if (int_status & USB_OTG_GINTSTS_LPMINT) {
            //                USBx->GINTSTS &= USB_OTG_GINTSTS_LPMINT;
            //            }
            if (int_status & USB_OTG_GINTSTS_SOF) {
                USBx->GINTSTS &= USB_OTG_GINTSTS_SOF;
            }
            if (int_status & USB_OTG_GINTSTS_SRQINT) {
                USBx->GINTSTS &= USB_OTG_GINTSTS_SRQINT;
            }
            if (int_status & USB_OTG_GINTSTS_OTGINT) {
                USBx->GINTSTS &= USB_OTG_GINTSTS_OTGINT;
            }
        }
    }
#endif
}